export default {
  aboutMe:
    "привет! я Макс, учу веб-разработку в виде React/Vue, приступаю к Rust'у — буду делать микросервисы и TUI штучки. делаю смешные фичи для /tg/station, пишу Telegram ботов и помогаю с их настройкой. принимаю баунти -w-",
  myMidniht: "моя полночь в",
  active: "обычно я доступен 9-23",
  connections: "Где меня найти",
  auth: "Аутентификация...",
  loginWithGithub: "Войди c GitHub",
  toLeaveSigns: "чтобы оставлять сигны!",
  fetchingSigns: "Фетчинг сигн...",
  authViaGitHub: "Аутентифицирован через GitHub",
  sign_header: "Оставить сигну",
  sign_noneYet: "Тут пока ничего нет — оставь первую сигну!",
  sign_aboutHeader: "Что такое сигна?",
  sign_aboutDesc:
    'Сигна, от англоязычного "sign" (знак, подпись) — что-то вроде отметки "я был здесь". Может, вы хотите дать другим что-то знать обо мне или просто передать привет — всех замечу! \nСигну можно оставить анонимно, виден будет только ваш аватар, а можно оставить ссылку на GitHub и даже короткое сообщение.',
  sign_placeholder: "Текст сообщения (опционально):",
  sign_anonymous: "Быть анонимусом",
  sign_anonymousExplain:
    "Оставляя сигну анонимно, никто не увидит ничего кроме вашего аватара и сообщения",
  sign_sendAction: "Отправить сигну",
  sign_sending: "Отправка...",
  sign_toastAlreadyLeft: "Ты уже оставил целую одну сигну!",
  sign_toastRestricted:
    "Тебе нельзя оставлять сигны. Что-то ты явно сделал не так. Высказываю своё осуждение.",
  sign_toastSent: "Сигна отправлена!",
  sign_toastErrorNetwork: "Ошибка запроса к сети",
  sign_toastErrorOther:
    "Возникла какая-то проблема. Попробуйте оставить сигну позже...",
} as const;
